src/main/java/com/rahgozin/gate/my.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ars:QueryPaymentLogRequestMsg xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices">
            <RequestHeader>
                <cbs:Version xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon">1</cbs:Version>
                <cbs:BusinessCode xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon">queryPaymentLog</cbs:BusinessCode>
                <cbs:MessageSeq xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon">663_20180818_094922_337696239694</cbs:MessageSeq>
                <OwnershipInfo xmlns="http://www.huawei.com/bme/cbsinterface/cbscommon">
                    <BEID>10101</BEID>
                </OwnershipInfo>
                <AccessSecurity xmlns="http://www.huawei.com/bme/cbsinterface/cbscommon">
                    <LoginSystemCode>714</LoginSystemCode>
                    <Password>kQwkaEwWU0gravIASYtwcf0XZq2BP0ahtPj/DKXeZyE=</Password>
                </AccessSecurity>
                <OperatorInfo xmlns="http://www.huawei.com/bme/cbsinterface/cbscommon">
                    <OperatorID>714</OperatorID>
                    <ChannelID>714</ChannelID>
                </OperatorInfo>
            </RequestHeader>
            <QueryPaymentLogRequest>
                <ars:AcctAccessCode xsi:type="ars:AcctAccessCode_type0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <arc:PrimaryIdentity xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">9125053921</arc:PrimaryIdentity>
                    <arc:AccountKey xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon"/>
                    <arc:AccountCode xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon"/>
                </ars:AcctAccessCode>
                <ars:TotalRowNum>0</ars:TotalRowNum>
                <ars:BeginRowNum>0</ars:BeginRowNum>
                <ars:FetchRowNum>1000</ars:FetchRowNum>
                <ars:StartTime>20220622000000</ars:StartTime>
                <ars:EndTime>20230518235959</ars:EndTime>
            </QueryPaymentLogRequest>
        </ars:QueryPaymentLogRequestMsg>
    </soapenv:Body>
</soapenv:Envelope>